Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/civil_law/personal_injuries_assessment_board.html.txt.tmx
Source language: en
Languages: ga

source: InjuriesBoard.ie, formerly known as the Personal Injuries Assessment Board (PIAB), is an independent statutory body set up under the Personal Injuries Assessment Board Act 2003
ga: Is comhlacht reachtúil neamhspleách é InjuriesBoard.ie, a tugadh an Bord Measúnaithe Díobhálacha Pearsanta air roimhe seo, a bunaíodh faoin Acht um Bord Measúnaithe Díobhálacha Pearsanta 2003

source: All personal injury claims in Ireland (except for cases involving medical negligence) must be submitted to InjuriesBoard.ie
ga: Caithfear gach éileamh um dhíobháil phearsanta in Éirinn (cásanna a bhaineann le faillí leighis as an áireamh) a chur faoi bhráid InjuriesBoard.ie

source: The Board provides an independent assessment of personal injury claims for compensation following road traffic, workplace or public liability accidents
ga: Tugann an Bord measúnú neamhspleách ar éilimh do dhíobhálacha pearsanta ar chúiteamh tar éis tionóisc tráchta, ag an áit oibre nó dliteanais phoiblí

source: Where the person responsible (the respondent) does not consent to InjuriesBoard.ie assessing your claim for compensation, InjuriesBoard.ie will allow you to pursue your claim through the courts
ga: I gcás nach bhfuil an duine atá freagrach (an freagróir) le toiliú InjuriesBoard.ie measúnú a dhéanamh ar d'éileamh ar chúiteamh, beidh InjuriesBoard.ie deis a thabhairt duit a shaothrú d'éileamh trí na cúirteanna

source: Claims are assessed on average within 7 months of the respondent consenting
ga: Déantar measúnú ar éilimh taobh istigh de 7 mí ar an meán, le toiliú ón bhfreagróir

source: Personal injury claims through litigation (that is, the courts) can take up to 36 months (3 years)
ga: Is féidir le héilimh ar dhíobháil phearsanta trí dhlíthíocht (is é sin, na Cúirteanna) suas le 36 mí (3 bliana) a thógáil

source: Claims are assessed using the medical evidence you provide from your doctor and, if necessary, a report provided by an independent doctor appointed by InjuriesBoard.ie
ga: Déantar measúnú ar éilimh ag úsáid na fianaise leighis ó do dhochtúir a chuir tú ar fáil, agus, más gá, tuairisc a chuir dochtúir neamhspleách a cheap InjuriesBoard.ie ar fáil

source: The assessment of the damages due is made having regard to the particular injuries you sustained and your circumstances
ga: Déantar an measúnú maidir leis na damáistí atá dlite le haird ar na gortuithe ar leith a bhain duit agus ar do imthosca

source: Guideline amounts for compensation in respect of particular injuries are set out in the Book of Quantum (pdf)
ga: Tá treoir-mhéideanna i gcomhair cúitimh maidir le cineálacha áirithe gortuithe leagtha síos sa Book of Quantum (pdf)

source: An online version known as the Estimator as well as some FAQ’s are available on the Board's website
ga: Tá leagan ar líne ar a dtugtar an Estimator chomh maith le roinnt Ceisteanna Coitianta ar fáil ar láithreán gréasáin an Bhoird

source: If the respondent does not agree to an assessment by InjuriesBoard.ie or if either side rejects the Board’s award, the matter can then be referred to the courts
ga: Má dhiúltaíonn an freagróir do mheasúnú ó InjuriesBoard.ie nó má dhiúltaíonn ceachtar taobh do dhámhachtain an Bhoird, is féidir an cheist a chur ar aghaidh chuig na cúirteanna ansin

source: Under Section 17 of the 2003 Act, if your injury consists wholly or in part of psychological damage which would be difficult to assess by means of the Board’s assessment procedures, the Board may give you permission to pursue your claim through the courts without an assessment of your claim
ga: Faoi Alt 17 d’Acht 2003, má tá díobháil shíceolaíoch i gceist le do ghortú go hiomlán nó go páirteach ar dheacair í a mheasúnú trí nósanna imeachta measúnaithe an Bhoird, féadfaidh an Bord cead a thabhairt duit chun tabhairt faoi d’éileamh trí na cúirteanna gan measúnú a dhéanamh ar d’éileamh

source: Since August 2014, under the Recovery of Certain Benefits and Assistance Scheme the Department of Social Protection can recover the value of certain illness-related social welfare payments from compensation awards
ga: Ó Lúnasa 2014, faoin scéim Aisghabháil Sochar agus Cúnamh Áirithe, is féidir leis an Roinn Coimirce Sóisialaí ghnóthú an luach na n-íocaíochtaí leasa shóisialaigh breoiteacht áirithe a bhaineann ó dámhachtainí cúitimh

source: The benefits are recovered from the compensator and not from the injured person
ga: Na buntáistí a ghabháil ó compensator agus ní ón duine gortaithe

source: Under the Civil Liabilities and Courts Act 2004 the time-limit for claims for compensation is two years from the date of the accident
ga: Faoin Acht um Dhliteanas Sibhialta agus Cúirteanna 2004 is í an teorainn ama i gcomhair éilimh ar chúiteamh ná dhá bhliain ó dháta na timpiste

source: Even so, it is very important that you notify in writing the person you hold responsible for your injury of the nature of the wrong they have committed within two months of the accident
ga: Mar sin féin, tá sé an-tábhachtach go gcuirfidh tú i scríbhinn don duine a mheasann tú atá freagrach as do thimpiste ar nádúr an mícheart siad tiomanta taobh istigh de dhá mhí ón timpiste

source: While it may not affect your application to the Board, it may affect your case later if you have to go to court
ga: Cé nach mbeidh tionchar aige ar d’iarratas chuig an mBord, d’fhéadfadh tionchar a bheith aige ar do chás níos déanaí má bhíonn ort dul chuig an gcúirt

source: When InjuriesBoard.ie receives your application for compensation, it will issue a receipt for the fee and an application number
ga: Nuair a fhaigheann InjuriesBoard.ie d’iarratas ar chúiteamh, eiseoidh sé admháil don táille agus uimhir iarratais

source: It will then inform the person you hold responsible for your injury (the respondent) about your claim
ga: Ansin cuirfidh sé an duine a mheasann tú atá freagrach as do ghortú (an freagróir) ar an eolas faoi d’éileamh

source: The respondent has 90 days to consent to the Board assessing your claim
ga: Tá 90 lá ag an bhfreagróir chun toiliú leis an mBord ag déanamh measúnú ar d’éileamh

source: If the respondant agrees to this, he/she must pay a fee
ga: Má aontaíonn an freagróir é seo a dhéanamh, ní mór dó/di táille a íoc

source: If the respondent does not do this, the Board will issue you with an Authorisation
ga: Mura ndéanann an freagróir é seo, eiseoidh an Bord Údarú ort

source: This is a legal document allowing you to proceed with your claim through the courts if you so wish
ga: Is doiciméad dlí é seo a thugann cead duit dul ar aghaidh le d’éileamh tríd na Cúirteanna más mian leat

source: When the Board makes its assessment, you, as the claimant, have 28 days to decide whether you accept or reject the award
ga: Nuair a dhéanann an Bord a mheasúnú, tá 28 lá agatsa, mar éilitheoir, chun cinneadh a dhéanamh an nglacann tú leis an dámhachtain nó nach nglacann

source: If you accept it, you must acknowledge this in writing to InjuriesBoard.ie
ga: Má ghlacann tú leis, ní mór duit é seo a chur in iúl do InjuriesBoard.ie i scríbhinn

source: If you don’t reply within 28 days, it is deemed that you have rejected the assessment
ga: Mura bhfreagraíonn tú taobh istigh de 28 lá, meastar go bhfuil tú tar éis an measúnú a dhiúltú

source: The respondent has 21 days to accept or reject the assessment
ga: Tá 21 lá ag an bhfreagróir chun glacadh leis an measúnú nó é a dhiúltú

source: If the respondent does not reply within this time limit, it will be deemed he/she has accepted the assessment
ga: Mura bhfreagraíonn an freagróir taobh istigh den teorainn ama seo, measfar go bhfuil sé/sí tar éis glacadh leis an measúnú

source: If both parties accept the assessment, the Board will issue an Order to Pay to the respondent
ga: Má ghlacann an dá pháirtí leis an measúnú, eiseoidh an Bord Ordú Íocaíochtaar an bhfreagróir

source: If either you or the respondent rejects the assessment, the Board will issue you with an Authorisation allowing you to take your claim to court
ga: Má dhiúltaíonn tusa nó an freagróir don mheasúnú, eiseoidh an Bord Údarú ort a cheadóidh duit d’éileamh a thabhairt chun na Cúirte

source: You can read more about Making a Claim and Responding to a Claim on the Board's website
ga: Is féidir leat tuilleadh a léamh faoi Éileamh a Dhéanamh agus Éileamh a Fhreagairt ar láithreán gréasáin an Bhoird

source: Claimants are charged €45 to make an application to InjuriesBoard.ie for compensation for a personal injury
ga: Gearrtar €45 ar éilitheoirí chun iarratas a dhéanamh ar InjuriesBoard.ie ar chúiteamh ar dhíobháil phearsanta

source: For respondents, if a claim has been made against you and you agree to allow assessment by InjuriesBoard.ie you must pay a fee of €600 (was €850 before January 2013)
ga: I gcás freagróirí, má tá éileamh déanta i do choinne agus go n-aontaíonn tú measúnú ón InjuriesBoard.ie a cheadú, ní mór duit táille €600 a íoc

source: If your insurance company has agreed to handle the claim on your behalf, it will pay this fee
ga: Má d’aontaigh do chuideachta árachais an t-éileamh a láimhseáil ar do shon, íocfaidh sí sin an táille seo

source: To make a personal injury claim for compensation you can:
ga: Chun éileamh a dhéanamh ar chúiteamh i gcomhair díobháil phearsanta, is féidir leat:

source: • Submit your application online or
ga: • D’iarratas a sheoladh isteach ar líne nó

source: • Submit your application by post to InjuriesBoard.ie
ga: • D’iarratas a sheoladh isteach chuig InjuriesBoard.ie sa phost

source: The following documentation is required for you to complete your application:
ga: Teastaíonn na doiciméid seo a leanas ionas gur féidir leat d’iarratas a chomhlánú:

source: • A completed Application Form (Form A) (pdf) which can be submitted online or by post
ga: • Foirm Iarratais (Foirm A) (pdf) comhlánaithe - is féidir leat é seo a sheoladh isteach ar líne nó sa phost

source: • A Medical Assessment Form (Form B) (pdf) completed by your treating doctor
ga: • Foirm Mheasúnú Leighis (Foirm B) (pdf) comhlánaithe ag an dochtúir atá ag cur cóir leighis ort

source: This can be submitted by you online or by post
ga: Is féidir leat é seo a sheoladh isteach ar líne nó sa phost

source: This can be paid by telephone using a credit or debit card
ga: Is féidir é seo a íoc ar an teileafón ag úsáid cárta creidmheasa nó cárta dochair

source: They can also be used online if you are submitting your application online
ga: Is féidir leat iad a úsáid ar líne chomh maith má tá d’iarratas á sheoladh isteach agat ar líne

source: Alternatively, you can send a cheque or postal order, payable to InjuriesBoard.ie, by post
ga: Nó is féidir leat seic nó ordú poist a sheoladh isteach sa phost, le híoc le InjuriesBoard.ie

source: You should also provide receipts for any financial loss that you have incurred as a result of the accident, together with any other documentation you may consider relevant to your claim
ga: Ba chóir duit admhálacha a chur ar fáil i gcomhair aon chaillteanas airgeadais a bhain duit mar thoradh ar an timpiste, chomh maith le haon dhoiciméid eile a cheapann tú a bhaineann le d’éileamh

source: If making an application on behalf of child (someone under age 18) or on behalf of someone who has been fatally injured, you must make the application by post
ga: Má tá iarratas á dhéanamh agat ar son linbh (duine faoi 18 mbliana d’aois) nó ar son duine éigin a gortaíodh go marfach, ní mór duit an t-iarratas a dhéanamh tríd an bpost

source: Also, you must use a Fatal Accident Application Form (Form A) (pdf) when claiming for someone fatally injured
ga: Ina theannta sin, ní mór duit Foirm Iarratais Tionóisce Marfaí (Foirm A) (pdf) a úsáid nuair atá éileamh á dhéanamh agat do dhuine a gortaíodh go marfach

source: The Board’s leaflet Claimant Guide (pdf) contains further information on the application and assessment process
ga: Tá tuilleadh eolais i mbileog an Bhoird Claimant Guide (pdf) maidir leis an iarratas agus an próiseas measúnaithe

source: The Board also has a leaflet entitled How to respond to a claim (pdf) for respondents
ga: Tá bileog ag an mBord dar teideal Conas freagairt d’éileamh (pdf) d’fhreagróirí

source: You can download copies of the Application Form and the Medical Assessment Form from the Board's website
ga: Is féidir leat cóipeanna den Fhoirm Iarratais agus den Fhoirm Mheasúnú Leighis a íoslódáil ó láithreán gréasáin an Bhoird

source: If you have any further queries in connection with making a claim to the Board or about the application process, contact it directly as follows:
ga: Má tá aon cheisteanna eile agat a bhaineann le héileamh a dhéanamh chuig an mBord nó faoin bpróiseas iarratais, téigh i dteagmháil leis go díreach mar seo a leanas:
